//
//  DZ 22 - Obj_Skut_Touch.c
//  DZ 22 - Obj_Skut_Touch
//
//  Created by mac on 11.11.17.
//  Copyright © 2017 Dima Zgera. All rights reserved.
//

/*
 #include "DZ 22 - Obj_Skut_Touch.h"
 
 
Вот такой вот урок по тачам. Решил жесты и тачи в один урок не объединять, а относительно простой функционал тачей решил дополнить практическим примером :)

Уровень супермен (остальных уровней не будет)

1. Создайте шахматное поле (8х8), используйте черные сабвьюхи
2. Добавьте белые и красные шашки на черные клетки (используйте начальное расположение в шашках)
3. Реализуйте механизм драг'н'дроп подобно тому, что я сделал в примере, но с условиями:
4. Шашки должны ставать в центр черных клеток.
5. Даже если я отпустил шашку над центром белой клетки - она должна переместиться в центр ближайшей к отпусканию черной клетки.
6. Шашки не могут становиться друг на друга
7. Шашки не могут быть поставлены за пределы поля.

Вот такое вот веселое практическое задание :)
*/
